legacy/predescribedMotion/tutorials/steelBallRun-pimple/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Kinematic pressure  p/rho  [m^2/s^2]
// freeFallingPimpleFoam uses the incompressible pimpleFoam formulation.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front           { type empty; }
    back            { type empty; }

    top             { type zeroGradient; }
    bottom          { type zeroGradient; }

    // At least one pressure outlet must be fixedValue so adjustPhi works
    farWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    sphere          { type zeroGradient; }
    symmetry        { type symmetry; }
}

// ************************************************************************* //
